/*
Задача 1, скомпилировать и запустить пример
*/


public class Hello {
public static void main (String [] args) {

		System.out.println("Hello world");

}
}